Revit 2024 API
AirSystemData.HeatExchangerType Property
 The type of heat exchanger.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public AirHeatExchangerType HeatExchangerType { get; set; }
Visual Basic
Public Property HeatExchangerType As AirHeatExchangerType
	Get
	Set
Visual C++
public:
property AirHeatExchangerType HeatExchangerType {
	AirHeatExchangerType get ();
	void set (AirHeatExchangerType value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
AirSystemData Class
Autodesk.Revit.DB.Mechanical Namespace